{
  "id": "question_232",
  "number": 232,
  "topic": "Topic 1",
  "text": "You need to use TensorFlow to train an image classification model. Your dataset is located in a Cloud Storage directory and contains millions of labeled images. Before training the model, you need to prepare the data. You want the data preprocessing and model training workflow to be as efficient, scalable, and low maintenance as possible. What should you do?",
  "choices": [
    {
      "letter": "A",
      "text": "1. Create a Dataflow job that creates sharded TFRecord files in a Cloud Storage directory.<br/>2. Reference tf.data.TFRecordDataset in the training script.<br/>3. Train the model by using Vertex AI Training with a V100 GPU.",
      "is_most_voted": true,
      "is_correct": true
    },
    {
      "letter": "B",
      "text": "1. Create a Dataflow job that moves the images into multiple Cloud Storage directories, where each directory is named according to the corresponding label<br/>2. Reference tfds.folder_dataset:ImageFolder in the training script.<br/>3. Train the model by using Vertex AI Training with a V100 GPU.",
      "is_most_voted": false,
      "is_correct": false
    },
    {
      "letter": "C",
      "text": "1. Create a Jupyter notebook that uses an nt-standard-64 V100 GPU Vertex AI Workbench instance.<br/>2. Write a Python script that creates sharded TFRecord files in a directory inside the instance.<br/>3. Reference tf.data.TFRecordDataset in the training script.<br/>4. Train the model by using the Workbench instance.",
      "is_most_voted": false,
      "is_correct": false
    },
    {
      "letter": "D",
      "text": "1. Create a Jupyter notebook that uses an n1-standard-64, V100 GPU Vertex AI Workbench instance.<br/>2. Write a Python script that copies the images into multiple Cloud Storage directories, where each. directory is named according to the corresponding label.<br/>3. Reference tfds.foladr_dataset.ImageFolder in the training script.<br/>4. Train the model by using the Workbench instance.",
      "is_most_voted": false,
      "is_correct": false
    }
  ],
  "correct_answer": "A",
  "explanation": "",
  "voting_data": {
    "total_votes": 12,
    "vote_distribution": {},
    "most_voted_answer": "A",
    "confidence_score": 1.0
  },
  "metadata": {
    "extraction_timestamp": "2025-05-29T12:21:33.363394",
    "source_url": "data/input/page-5.html",
    "page_number": 1,
    "difficulty_level": ""
  }
}
