{
  "id": "question_2",
  "number": 2,
  "topic": "Topic 1",
  "text": "Your organization wants to make its internal shuttle service route more efficient. The shuttles currently stop at all pick-up points across the city every 30 minutes between 7 am and 10 am. The development team has already built an application on Google Kubernetes Engine that requires users to confirm their presence and shuttle station one day in advance. What approach should you take?",
  "choices": [
    {
      "letter": "A",
      "text": "1. Build a tree-based regression model that predicts how many passengers will be picked up at each shuttle station. 2. Dispatch an appropriately sized shuttle and provide the map with the required stops based on the prediction.",
      "is_most_voted": false,
      "is_correct": false
    },
    {
      "letter": "B",
      "text": "1. Build a tree-based classification model that predicts whether the shuttle should pick up passengers at each shuttle station. 2. Dispatch an available shuttle and provide the map with the required stops based on the prediction.",
      "is_most_voted": false,
      "is_correct": false
    },
    {
      "letter": "C",
      "text": "1. Define the optimal route as the shortest route that passes by all shuttle stations with confirmed attendance at the given time under capacity constraints. 2. Dispatch an appropriately sized shuttle and indicate the required stops on the map.",
      "is_most_voted": false,
      "is_correct": true
    },
    {
      "letter": "D",
      "text": "1. Build a reinforcement learning model with tree-based classification models that predict the presence of passengers at shuttle stops as agents and a reward function around a distance-based metric. 2. Dispatch an appropriately sized shuttle and provide the map with the required stops based on the simulated outcome.",
      "is_most_voted": false,
      "is_correct": false
    }
  ],
  "correct_answer": "C",
  "explanation": "",
  "voting_data": {
    "total_votes": 19,
    "vote_distribution": {},
    "most_voted_answer": "C",
    "confidence_score": 1.0
  },
  "metadata": {
    "extraction_timestamp": "2025-05-29T12:03:58.923384",
    "source_url": "data/input/page-1.html",
    "page_number": 1,
    "difficulty_level": ""
  }
}
