{
  "id": "question_161",
  "number": 161,
  "topic": "Topic 1",
  "text": "You are an ML engineer at a manufacturing company. You are creating a classification model for a predictive maintenance use case. You need to predict whether a crucial machine will fail in the next three days so that the repair crew has enough time to fix the machine before it breaks. Regular maintenance of the machine is relatively inexpensive, but a failure would be very costly. You have trained several binary classifiers to predict whether the machine will fail, where a prediction of 1 means that the ML model predicts a failure.\n\nYou are now evaluating each model on an evaluation dataset. You want to choose a model that prioritizes detection while ensuring that more than 50% of the maintenance jobs triggered by your model address an imminent machine failure. Which model should you choose?",
  "choices": [
    {
      "letter": "A",
      "text": "The model with the highest area under the receiver operating characteristic curve (AUC ROC) and precision greater than 0.5",
      "is_most_voted": false,
      "is_correct": false
    },
    {
      "letter": "B",
      "text": "The model with the lowest root mean squared error (RMSE) and recall greater than 0.5.",
      "is_most_voted": false,
      "is_correct": false
    },
    {
      "letter": "C",
      "text": "The model with the highest recall where precision is greater than 0.5.",
      "is_most_voted": false,
      "is_correct": true
    },
    {
      "letter": "D",
      "text": "The model with the highest precision where recall is greater than 0.5.",
      "is_most_voted": false,
      "is_correct": false
    }
  ],
  "correct_answer": "C",
  "explanation": "",
  "voting_data": {
    "total_votes": 11,
    "vote_distribution": {},
    "most_voted_answer": "C",
    "confidence_score": 1.0
  },
  "metadata": {
    "extraction_timestamp": "2025-05-29T12:16:18.325584",
    "source_url": "data/input/page-4.html",
    "page_number": 1,
    "difficulty_level": ""
  }
}
